system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Simple rectangular room with side inlet/outlet vents
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    // Room corners (10m x 6m x 4m)
    (0 0 0)      // 0
    (10 0 0)     // 1
    (10 6 0)     // 2
    (0 6 0)      // 3
    (0 0 4)      // 4
    (10 0 4)     // 5
    (10 6 4)     // 6
    (0 6 4)      // 7
);

blocks
(
    // Room block: 40x24x16 cells
    hex (0 1 2 3 4 5 6 7) (40 24 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)  // left wall as inlet
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)  // right wall as outlet
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)  // front wall (y=0)
            (2 3 7 6)  // back wall (y=6)
            (0 1 2 3)  // floor (z=0)
            (4 5 6 7)  // ceiling (z=4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
