constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Thermophysical properties for air using Boussinesq approximation
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleEnthalpy;   // buoyantSimpleFoam requires sensibleEnthalpy
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.97;
    }
    thermodynamics
    {
        Cp              1005;       // J/(kg·K)
        Hf              0;
    }
    transport
    {
        mu              1.8e-5;     // Pa·s
        Pr              0.71;
    }
}

// Boussinesq coefficients (rho = rhoRef*(1 - beta*(T - TRef)))
boussinesqCoeffs
{
    rhoRef          1.2;        // kg/m^3  (air at ~300 K)
    beta            3.3e-3;     // 1/K
    TRef            300;        // K
}

// ************************************************************************* //
