system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 300
);

regions
(
    // Switchgear cabinet region (4–5.5 m along x, 2.5–3.5 m along y, 0–2 m height)
    // Initialise cells inside the switchgear volume to elevated temperature
    boxToCell
    {
        box (4 2.5 0) (5.5 3.5 2);

        fieldValues
        (
            volScalarFieldValue T 360    // ~87°C — warm equipment start
        );
    }
);

// ************************************************************************* //
